---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.LandingDepthIsLessThanRunWidthWarning
source: html/f9f0d06b-1ee5-abe5-cda2-47e109662d77.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.LandingDepthIsLessThanRunWidthWarning Property

Landing depth is less than run width.

## Syntax (C#)
```csharp
public static FailureDefinitionId LandingDepthIsLessThanRunWidthWarning { get; }
```